Revit 2026 API

# MacroModuleIteratorGetCurrent Method

---

Returns the current Macro.

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Macro GetCurrent()
```
```vb
Public Function GetCurrent As Macro
```
```cpp
public:
Macro^ GetCurrent()
```
```fsharp
member GetCurrent : unit -> Macro
```

#### Return Value

Macro The current Macro.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

#### Reference

MacroModuleIterator Class

Autodesk.Revit.DB.Macros Namespace